Revit 2027 API
IFCExtrusionCreationData.SetLocalPlacement Method
 Sets the data to reference an IfcLocalPlacement handle when creating the extrusion. Side effect: will set ReuseLocalPlacement to true.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLocalPlacement(
	IFCAnyHandle localPlacement
)
Public Sub SetLocalPlacement (
	localPlacement As IFCAnyHandle
)
public:
void SetLocalPlacement(
	IFCAnyHandle^ localPlacement
)
member SetLocalPlacement :
        localPlacement : IFCAnyHandle -> unit
Parameters
localPlacement IFCAnyHandle
 The IfcLocalPlacement handle.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace